// - створити функцію яка обчислює та повертає площу прямокутника висотою
function s_rectangle(a,b){
    return (a+b)*2;
}
s_rec=s_rectangle(10, 20);
console.log(`площадь прямоугольника = ${s_rec}`);

// - створити функцію яка обчислює та повертає площу кола
function s_round(r){
    return 2*3.14*r**2;
}
s_round=s_round(3);
console.log(`площадь круга = ${s_round}`);

// - створити функцію яка обчислює та повертає площу циліндру
function s_cil(h, r){
    return 2*3.14*r*(r+h);
}
s_cil=s_cil(5,3);
console.log(`площадь поверхности цилиндра = ${s_cil}`);

// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
// (Math використовувати заборонено);
//???????????

// - створити функцію яка при створює блок з текстом. Текст задати через аргумент
function text_block(a){
    document.write(`<div>${a}</div>`);
}
a='qweqweqweqwe';
text_block(a);

// - створити функцію яка при створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка при створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список